In [264]:
import pandas as pd
import numpy as np

# Load Multiple Excel Worksheets in Pandas

Example:
import pandas as pd  
df = pd.read_excel('users.xlsx', sheet_name = [0,1,2])  
df = pd.read_excel('users.xlsx', sheet_name = ['User_info','compound'])  
df = pd.read_excel('users.xlsx', sheet_name = None)   
Read all sheets

In [265]:
# Define filepath
filepath = 'KPMG_VI_New_raw_data_update_final.xlsx'

# Load Excel file using Pandas with `sheet_name=None`
df_dict = pd.read_excel(filepath, sheet_name=None)

# Preview
df_dict.keys()

dict_keys(['Title Sheet', 'Transactions', 'NewCustomerList', 'CustomerDemographic', 'CustomerAddress'])

### CustomerDemographic

In [266]:
# Selecting CustomerDemographic sheet
df_Customer_Demographic =df_dict['CustomerDemographic']

# changing first row to header
df_Customer_Demographic.rename(columns=df_Customer_Demographic.iloc[0,:],inplace=True)

# removing the first row which is already been used as header 
df_Customer_Demographic=df_Customer_Demographic.loc[1:].reset_index(drop=True)

# droping columns with having each row as NaN
df_Customer_Demographic = df_Customer_Demographic.dropna(axis=1,how='all')
df_Customer_Demographic.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11
1,2,Eli,Bockman,Male,81,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16
2,3,Arlin,Dearle,Male,61,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15
3,4,Talbot,NaN,Male,33,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8

In [267]:
print(df_Customer_Demographic.shape)
print(df_Customer_Demographic.isnull().sum())

(4000, 13)
customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

#### gender

In [268]:
df_Customer_Demographic.gender.value_counts()

Female    2037
Male      1872
U           88
M            1
Femal        1
F            1
Name: gender, dtype: int64

In [269]:
df_Customer_Demographic['gender'].mask(df_Customer_Demographic['gender']=='M','Male',inplace=True)
df_Customer_Demographic['gender'].mask(df_Customer_Demographic['gender']=='F','Female',inplace=True)
df_Customer_Demographic['gender'].mask(df_Customer_Demographic['gender']=='Femal','Female',inplace=True)
df_Customer_Demographic['gender'].mask(df_Customer_Demographic['gender']=='U','Unknown',inplace=True)

In [270]:
df_Customer_Demographic.gender.value_counts()

Female     2039
Male       1873
Unknown      88
Name: gender, dtype: int64

#### past_3_years_bike_related_purchases

In [271]:
df_Customer_Demographic['past_3_years_bike_related_purchases'].describe()

count     4000
unique     100
top         19
freq        56
Name: past_3_years_bike_related_purchases, dtype: int64

#### DOB

Calculating age of the customer using the Date of birth

In [272]:
from datetime import date
 
def age(birthdate):
    today = date.today()
    age = today.year - birthdate.year - ((today.month, today.day) < (birthdate.month, birthdate.day))
    return age

In [273]:
#First you need to define the format of date column.
df_Customer_Demographic['DOB'] = pd.to_datetime(df_Customer_Demographic['DOB'], format='%Y-%m-%d %H:%M:%S')

In [274]:
df_Customer_Demographic['Age']=df_Customer_Demographic['DOB'].apply(lambda x : age(x))

In [275]:
def age_group(age):
    if age>=0 and age<11:
        return 'below 10'
    if age>=10 and age<21:
        return '10s'
    if age>=20 and age<30:
        return '20s'
    if age>=30 and age<40:
        return '30s'
    if age>=40 and age<50:
        return '40s'
    if age>=50 and age<60:
        return '50s'
    if age>=60 and age<70:
        return '60s'
    if age>=70 and age<80:
        return '70s'
    if age>=80 and age<90:
        return '80s'
    if age>=90 and age<100:
        return '90s'

In [276]:
df_Customer_Demographic['Age_group']=df_Customer_Demographic['Age'].apply(lambda x : age_group(x))

In [277]:
df_Customer_Demographic['Age_group'].value_counts(sort=True)

40s    1320
50s     704
30s     682
60s     624
20s     576
80s       2
70s       2
90s       1
10s       1
Name: Age_group, dtype: int64

#### job_title

There is 195 types of job tittle.

In [278]:
df_Customer_Demographic['job_title'].unique()

array(['Executive Secretary', 'Administrative Officer',
       'Recruiting Manager', nan, 'Senior Editor', 'Media Manager I',
       'Business Systems Development Analyst', 'Senior Quality Engineer',
       'Nuclear Power Engineer', 'Developer I', 'Account Executive',
       'Junior Executive', 'Media Manager IV', 'Sales Associate',
       'Professor', 'Geological Engineer', 'Project Manager',
       'Safety Technician I', 'Research Assistant I',
       'Accounting Assistant III', 'Editor', 'Research Nurse',
       'Safety Technician III', 'Staff Accountant III', 'Legal Assistant',
       'Product Engineer', 'Information Systems Manager',
       'VP Quality Control', 'Social Worker', 'Senior Cost Accountant',
       'Assistant Media Planner', 'Payment Adjustment Coordinator',
       'Food Chemist', 'Accountant III', 'Director of Sales',
       'Senior Financial Analyst', 'Registered Nurse',
       'Biostatistician II', 'Computer Systems Analyst II',
       'Software Test Engineer II', 'Paralegal', 'VP Sales',
       'Chief Design Engineer', 'Office Assistant III',
       'Physical Therapy Assistant', 'Help Desk Operator',
       'Web Developer II', 'Research Associate', 'Teacher',
       'VP Product Management', 'Statistician II',
       'Automation Specialist IV', 'Data Coordiator',
       'Software Test Engineer III', 'Internal Auditor',
       'Analyst Programmer', 'Occupational Therapist',
       'Speech Pathologist', 'Quality Control Specialist',
       'Civil Engineer', 'Software Engineer III',
       'Community Outreach Specialist', 'Safety Technician IV',
       'VP Accounting', 'General Manager', 'Nurse Practicioner',
       'Automation Specialist II', 'Marketing Assistant',
       'Marketing Manager', 'Staff Scientist', 'Assistant Professor',
       'Budget/Accounting Analyst IV', 'Associate Professor',
       'Graphic Designer', 'Administrative Assistant II',
       'Compensation Analyst', 'Systems Administrator III',
       'Financial Advisor', 'Chemical Engineer', 'Web Designer I',
       'Senior Developer', 'Office Assistant II', 'Recruiter', 'Operator',
       'Programmer Analyst III', 'Quality Engineer', 'Environmental Tech',
       'Analog Circuit Design manager', 'Cost Accountant', 'Librarian',
       'Structural Analysis Engineer', 'Pharmacist', 'Assistant Manager',
       'Accountant I', 'Web Designer III', 'Geologist III',
       'Software Test Engineer I', 'Structural Engineer',
       'Safety Technician II', 'Web Developer III',
       'Programmer Analyst II', 'Design Engineer', 'Statistician I',
       'VP Marketing', 'Desktop Support Technician', 'Actuary',
       'Database Administrator III', 'Electrical Engineer',
       'Tax Accountant', 'Clinical Specialist',
       'Database Administrator IV', 'Systems Administrator II',
       'Account Coordinator', 'Programmer III',
       'Administrative Assistant III', 'Nurse', 'Technical Writer',
       'Staff Accountant II', 'Dental Hygienist', 'Sales Representative',
       'Budget/Accounting Analyst III', 'Computer Systems Analyst IV',
       'Geologist I', 'Financial Analyst', 'Accounting Assistant II',
       'Senior Sales Associate', 'Database Administrator II',
       'Engineer I', 'Budget/Accounting Analyst I', 'Developer IV',
       'Database Administrator I', 'Environmental Specialist',
       'Computer Systems Analyst I', 'Account Representative IV',
       'Statistician IV', 'Human Resources Manager',
       'GIS Technical Architect', 'Programmer IV',
       'Accounting Assistant IV', 'Software Engineer IV', 'Programmer II',
       'Engineer III', 'Software Consultant', 'Biostatistician IV',
       'Help Desk Technician', 'Automation Specialist I', 'Developer III',
       'Human Resources Assistant I', 'Geologist IV', 'Media Manager II',
       'Statistician III', 'Engineer II', 'Health Coach II',
       'Developer II', 'Systems Administrator I', 'Web Developer I',
       'Software Engineer II', 'Accounting Assistant I',
       'Research Assistant II', 'Programmer Analyst IV', 'Health Coach I',
       'Accountant II', 'Automation Specialist III',
       'Administrative Assistant I', 'Health Coach IV',
       'Media Manager III', 'Account Representative III',
       'Web Designer IV', 'Budget/Accounting Analyst II',
       'Web Developer IV', 'Programmer I', 'Biostatistician III',
       'Software Test Engineer IV', 'Research Assistant IV',
       'Account Representative I', 'Accountant IV', 'Biostatistician I',
       'Human Resources Assistant IV', 'Administrative Assistant IV',
       'Office Assistant I', 'Human Resources Assistant II',
       'Mechanical Systems Engineer', 'Engineer IV', 'Health Coach III',
       'Office Assistant IV', 'Software Engineer I',
       'Human Resources Assistant III', 'Staff Accountant I',
       'Computer Systems Analyst III', 'Geologist II', 'Web Designer II',
       'Staff Accountant IV', 'Account Representative II',
       'Programmer Analyst I', 'Systems Administrator IV',
       'Research Assistant III'], dtype=object)

#### job_industry_category

There is 9 types of job_industry_category.

In [279]:
df_Customer_Demographic['job_industry_category'].unique()

array(['Health', 'Financial Services', 'Property', 'IT', nan, 'Retail',
       'Argiculture', 'Manufacturing', 'Telecommunications',
       'Entertainment'], dtype=object)

#### wealth_segment

In [280]:
df_Customer_Demographic['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

#### deceased_indicator

In [281]:
df_Customer_Demographic['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

#### default

Removing the default column from the dataset as it contains symboles and doesn't add value to data.

In [282]:
df_Customer_Demographic.drop('default',inplace=True,axis=1)

#### owns_car

In [283]:
df_Customer_Demographic['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

#### tenure

In [284]:
df_Customer_Demographic['tenure'].value_counts(sort=False)

1     166
2     150
3     160
4     191
5     228
6     192
7     235
8     211
9     200
10    218
11    221
12    202
13    191
14    200
15    179
16    215
17    182
18    208
19    159
20     96
21     54
22     55
Name: tenure, dtype: int64

In [285]:
for i in df_Customer_Demographic.columns:
    print('*********************************')
    print(df_Customer_Demographic[i].value_counts())

*********************************
1       1
2672    1
2659    1
2660    1
2661    1
       ..
1339    1
1340    1
1341    1
1342    1
4000    1
Name: customer_id, Length: 4000, dtype: int64
*********************************
Tobe        5
Max         5
Timmie      5
Kim         4
Kippy       4
           ..
Dominick    1
Arv         1
Jeniffer    1
Faustine    1
Baily       1
Name: first_name, Length: 3139, dtype: int64
*********************************
Ramsdell     3
Pristnor     3
Dahle        2
Haresign     2
Capper       2
            ..
Ors          1
Fullbrook    1
Suero        1
Groucock     1
Bestar       1
Name: last_name, Length: 3725, dtype: int64
*********************************
Female     2039
Male       1873
Unknown      88
Name: gender, dtype: int64
*********************************
19    56
16    56
67    54
20    54
2     50
      ..
8     28
85    27
95    27
86    27
92    24
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64
*********************************
1978-01-30    7
1978-08-19    4
1964-07-08    4
1976-09-25    4
1976-07-16    4
             ..
2001-01-22    1
1955-03-06    1
1966-08-05    1
1968-11-16    1
1958-08-02    1
Name: DOB, Length: 3448, dtype: int64
*********************************
Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Geologist II                             4
Health Coach I                           3
Research Assistant III                   3
Health Coach III                         3
Developer I                              1
Name: job_title, Length: 195, dtype: int64
*********************************
Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64
*********************************
Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64
*********************************
N    3998
Y       2
Name: deceased_indicator, dtype: int64
*********************************
Yes    2024
No     1976
Name: owns_car, dtype: int64
*********************************
7     235
5     228
11    221
10    218
16    215
8     211
18    208
12    202
9     200
14    200
6     192
4     191
13    191
17    182
15    179
1     166
3     160
19    159
2     150
20     96
22     55
21     54
Name: tenure, dtype: int64
*********************************
45.0     221
44.0     190
46.0     163
48.0     141
49.0     133
42.0     129
47.0     121
43.0     109
36.0     100
37.0      93
63.0      91
28.0      90
33.0      85
30.0      81
35.0      80
58.0      78
51.0      77
24.0      76
53.0      76
57.0      76
27.0      76
25.0      75
26.0      71
55.0      70
54.0      69
65.0      68
66.0      68
41.0      68
56.0      67
60.0      67
59.0      66
34.0      65
61.0      64
52.0      63
68.0      62
50.0      62
23.0      61
62.0      60
64.0      60
29.0      57
38.0      56
67.0      52
32.0      45
40.0      45
31.0      44
22.0      36
21.0      34
39.0      33
69.0      32
79.0       2
91.0       1
20.0       1
87.0       1
82.0       1
179.0      1
Name: Age, dtype: int64
*********************************
40s    1320
50s     704
30s     682
60s     624
20s     576
80s       2
70s       2
90s       1
10s       1
Name: Age_group, dtype: int64

### CustomerAddress

In [286]:
# Selecting CustomerAddress sheet
df_CustomerAddress =df_dict['CustomerAddress']

# changing first row to header
df_CustomerAddress.rename(columns=df_CustomerAddress.iloc[0,:],inplace=True)

## removing the first row which is already been used as header and selecting the starting 6 rows which contains the data
df_CustomerAddress=df_CustomerAddress.loc[1:,].reset_index(drop=True).iloc[:,:6]
df_CustomerAddress.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [287]:
print(df_CustomerAddress.shape)
print(df_CustomerAddress.isnull().sum())

(3999, 6)
customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [288]:
duplicate = df_CustomerAddress[df_CustomerAddress.duplicated()]
duplicate

Empty DataFrame
Columns: [customer_id, address, postcode, state, country, property_valuation]
Index: []

#### postcode

In [289]:
df_CustomerAddress['postcode'].value_counts().nlargest(10)

2170    31
2155    30
2145    30
2153    29
2770    26
2560    26
3977    26
2065    25
2763    22
2250    22
Name: postcode, dtype: int64

#### state

In [290]:
df_CustomerAddress['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [291]:
df_CustomerAddress['state'].mask(df_CustomerAddress['state']=='VIC','Victoria',inplace=True)
df_CustomerAddress['state'].mask(df_CustomerAddress['state']=='NSW','New South Wales',inplace=True)

In [292]:
df_CustomerAddress['state'].value_counts()

New South Wales    2140
Victoria           1021
QLD                 838
Name: state, dtype: int64

#### country

In [293]:
df_CustomerAddress['country'].value_counts()

Australia    3999
Name: country, dtype: int64

#### property_valuation

In [294]:
df_CustomerAddress['property_valuation'].value_counts(sort = False)

1     154
2     143
3     186
4     214
5     225
6     238
7     493
8     646
9     647
10    577
11    281
12    195
Name: property_valuation, dtype: int64

### Transactions

In [295]:
# Selecting CustomerDemographic sheet
df_Transactions =df_dict['Transactions']

# changing first row to header
df_Transactions.rename(columns=df_Transactions.iloc[0,:],inplace=True)

# removing the first row which is already been used as header
df_Transactions=df_Transactions.loc[1:,].reset_index(drop=True)

# droping columns with having each row as NaN
df_Transactions.dropna(axis=1,how='all',inplace=True)
df_Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25 00:00:00,False,Approved,Solex,Standard,medium,medium,71.49,53.62,41245
1,2,3,3120,2017-05-21 00:00:00,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701
2,3,37,402,2017-10-16 00:00:00,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361
3,4,88,3135,2017-08-31 00:00:00,False,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.1,36145
4,5,78,787,2017-10-01 00:00:00,True,Approved,Giant Bicycles,Standard,medium,large,1765.3,709.48,42226

In [296]:
duplicate = df_Transactions[df_Transactions.duplicated()]
duplicate

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, product_first_sold_date]
Index: []

In [297]:
print(df_Transactions.shape)
print(df_Transactions.isnull().sum())

(20000, 13)
transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

#### transaction_date

In [298]:
#First you need to define the format of date column.

df_Transactions['transaction_date'] = pd.to_datetime(df_Transactions['transaction_date'], format='%Y-%m-%d %H:%M:%S')
df_Transactions['transaction_year'] = pd.DatetimeIndex(df_Transactions['transaction_date']).year
df_Transactions['transaction_month'] = pd.DatetimeIndex(df_Transactions['transaction_date']).month
df_Transactions['transaction_day'] = pd.DatetimeIndex(df_Transactions['transaction_date']).day

In [299]:
df_Transactions.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,transaction_year,transaction_month,transaction_day
0,1,2,2950,2017-02-25,False,Approved,Solex,Standard,medium,medium,71.49,53.62,41245,2017,2,25
1,2,3,3120,2017-05-21,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701,2017,5,21
2,3,37,402,2017-10-16,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361,2017,10,16

#### online_order

In [300]:
df_Transactions['online_order'].value_counts()

True     9829
False    9811
Name: online_order, dtype: int64

#### order_status

In [301]:
df_Transactions['order_status'].value_counts()

Approved     19821
Cancelled      179
Name: order_status, dtype: int64

#### brand

In [302]:
df_Transactions['brand'].value_counts()

Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64

#### product_line

In [303]:
df_Transactions['product_line'].value_counts()

Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64

#### product_class

In [304]:
df_Transactions['product_class'].value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

#### product_size

In [305]:
df_Transactions['product_size'].value_counts()

medium    12990
large      3976
small      2837
Name: product_size, dtype: int64

#### list_price

In [306]:
df_Transactions['list_price'].astype(int).describe(percentiles=[.1,.2,.3,.4,.5,.6,.7,.8,.9])

count    20000.000000
mean      1107.321150
std        582.788382
min         12.000000
10%        235.000000
20%        533.000000
30%        742.000000
40%        980.000000
50%       1163.000000
60%       1289.000000
70%       1469.000000
80%       1762.000000
90%       1873.000000
max       2091.000000
Name: list_price, dtype: float64

#### standard_cost

In [307]:
df_Transactions['standard_cost'].astype(int,errors='ignore').describe(percentiles=[.1,.2,.3,.4,.5,.6,.7,.8,.9])

count     19803.00
unique      103.00
top         388.92
freq        465.00
Name: standard_cost, dtype: float64

# Join the dataset

In [369]:
final = pd.concat([df_Transactions, df_CustomerAddress, df_Customer_Demographic], axis=1, join='inner')
final.shape

(3999, 36)

# Performing EDA

In [370]:
final.shape

(3999, 36)

In [371]:
final.dtypes

transaction_id                                 object
product_id                                     object
customer_id                                    object
transaction_date                       datetime64[ns]
online_order                                   object
order_status                                   object
brand                                          object
product_line                                   object
product_class                                  object
product_size                                   object
list_price                                     object
standard_cost                                  object
product_first_sold_date                        object
transaction_year                                int64
transaction_month                               int64
transaction_day                                 int64
customer_id                                    object
address                                        object
postcode                                       object
state                                          object
country                                        object
property_valuation                             object
customer_id                                    object
first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases            object
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                         object
Age                                           float64
Age_group                                      object
dtype: object

In [372]:
final.isnull().sum()

transaction_id                           0
product_id                               0
customer_id                              0
transaction_date                         0
online_order                            59
order_status                             0
brand                                   23
product_line                            23
product_class                           23
product_size                            23
list_price                               0
standard_cost                           23
product_first_sold_date                 23
transaction_year                         0
transaction_month                        0
transaction_day                          0
customer_id                              0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  655
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
Age                                     87
Age_group                               88
dtype: int64

In [373]:
final.dropna().shape

(2720, 36)

In [374]:
final.state.unique()

array(['New South Wales', 'QLD', 'Victoria'], dtype=object)

#### Removing not required features

In [375]:
final.columns

Index(['transaction_id', 'product_id', 'customer_id', 'transaction_date',
       'online_order', 'order_status', 'brand', 'product_line',
       'product_class', 'product_size', 'list_price', 'standard_cost',
       'product_first_sold_date', 'transaction_year', 'transaction_month',
       'transaction_day', 'customer_id', 'address', 'postcode', 'state',
       'country', 'property_valuation', 'customer_id', 'first_name',
       'last_name', 'gender', 'past_3_years_bike_related_purchases', 'DOB',
       'job_title', 'job_industry_category', 'wealth_segment',
       'deceased_indicator', 'owns_car', 'tenure', 'Age', 'Age_group'],
      dtype='object')

In [376]:
final.drop(columns=['product_id' ,'customer_id','country','DOB'],inplace=True)

In [377]:
final.columns

Index(['transaction_id', 'transaction_date', 'online_order', 'order_status',
       'brand', 'product_line', 'product_class', 'product_size', 'list_price',
       'standard_cost', 'product_first_sold_date', 'transaction_year',
       'transaction_month', 'transaction_day', 'address', 'postcode', 'state',
       'property_valuation', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'Age', 'Age_group'],
      dtype='object')

#### Converting dates to Month name

In [378]:
#First you need to define the format of date column.
final['transaction_date'] = pd.to_datetime(final['transaction_date'], format='%Y-%m-%d %H:%M:%S')

In [379]:
import datetime
def months(mn):
    #provide month number
    mn=str(mn)
    datetime_object = datetime.datetime.strptime(mn, "%m")
    full_month_name = datetime_object.strftime("%B")
    return full_month_name

In [380]:
final['transaction_month']=final['transaction_month'].apply(months)

In [381]:
final['transaction_month']

0       February
1            May
2        October
3         August
4        October
          ...
3994      August
3995     October
3996         May
3997    November
3998       April
Name: transaction_month, Length: 3999, dtype: object

#### Converting dates to Days of the week

In [382]:

from datetime import datetime as date
#First you need to define the format of date column.
final['transaction_day'] = pd.to_datetime(final['transaction_date'], format='%Y-%m-%d %H:%M:%S').dt.day_name()

In [383]:
final['transaction_day']

0        Saturday
1          Sunday
2          Monday
3        Thursday
4          Sunday
          ...
3994      Tuesday
3995       Friday
3996    Wednesday
3997     Thursday
3998       Friday
Name: transaction_day, Length: 3999, dtype: object

In [384]:
final.to_csv('Combine.csv')